# Задание 1.2
a = int(input('Введите первое число'))
b = int(input('Введите второе число'))
c = int(input('Введите третье число'))
if a >= 1 and a <= 50:
    print(a)
if b >= 1 and b <= 50:
    print(b)
if c >= 1 and c <= 50:
    print(c)